In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['AreaName', 1980]]
df_new = df_new.head()

In [4]:
df_new

  AreaName  1980
0     Asia    16
1   Europe     1
2   Africa    80
3  Oceania     0
4   Europe     0

# T  ----- Transpose a Dataframe

In [5]:
df_new.T

             0       1       2        3       4
AreaName  Asia  Europe  Africa  Oceania  Europe
1980        16       1      80        0       0

In [6]:
df_new = df_new.T

In [7]:
df_new

             0       1       2        3       4
AreaName  Asia  Europe  Africa  Oceania  Europe
1980        16       1      80        0       0

In [8]:
df_new = df_new.T

In [9]:
df_new

  AreaName 1980
0     Asia   16
1   Europe    1
2   Africa   80
3  Oceania    0
4   Europe    0

In [10]:
df_new.T.T

  AreaName 1980
0     Asia   16
1   Europe    1
2   Africa   80
3  Oceania    0
4   Europe    0

In [11]:
df_new.T.T.T

             0       1       2        3       4
AreaName  Asia  Europe  Africa  Oceania  Europe
1980        16       1      80        0       0